{
  "switchLanguage": "Switch to  English",
  "pageNotFound": "Strona nie zostaa znaleziona",
  "backToHome": "Powr贸t do strony g贸wnej",
  "submitTitle": "Poszo!",
  "hero1": "Witaj!",
  "hero2": "Jestem <0>Daniel Alberski</0>",
  "hero3": "Frontend Developer",
  "submitText": "Twoja wiadomo zostaa pomylnie wysana! Wkr贸tce na ni odpisz 😉",
  "aboutMe": "O mnie",
  "aboutMeText": "Nauk programowania rozpoczem ju偶 w gimnazjum, zaczynajc od aplikacji desktopowych, przez mobilne, na webowych koczc. Obecnie skupiam si na pracy na frontendzie w ekosystemie React. Mam r贸wnie偶 dowiadczenie w Node.js, ale r贸wnie偶 w C#, PHP oraz React Native, kt贸rych to u偶ywaem w swoich prywatnych projektach. Jestem autorem mini bloga technologicznego, na kt贸rym omawiam interesujce mnie zagadnienia oraz dziel si swoimi projektami DIY czcymi programistyczn wiedz z pasj do elektroniki, oraz druku 3D.",
  "skills": "Technologie i umiejtnoci",
  "myProjects": "Moje projekty",
  "contact": "Kontakt",
  "contactText": "Chcesz si ze mn skontaktowa? Skorzystaj z formularza obok lub odezwij si na LinkedIn!",
  "nameField": "Twoje imi",
  "emailField": "Tw贸j e-mail",
  "messageField": "Tre wiadomoci",
  "sendButton": "Wylij",
  "footerRights": "Wszelkie prawa zastrze偶one.",
  "mainPageButton": "Strona g贸wna",
  "githubButton": "GitHub",
  "screenshotsButton": "Zrzuty ekranu",
  "frontendButton": "Frontend",
  "backendButton": "Backend",
  "projectPageButton": "Strona projektu",
  "articleButton": "Artyku",
  "videoButton": "Wideo",
  "redark": {
    "title": "Redark",
    "description": "Blog technologiczny stworzony w 2018 roku z myl o dzieleniu si swoj wiedz z dziedziny IT. Przez pierwsze dwa lata pracowa on pod kontrol WordPressa z autorskim motywem PHP. Z powodu czstych problem贸w ze stabilnoci oraz rosncych potrzeb personalizacji i szybkoci dziaania w 2020 roku zosta on pomylnie przeniesiony na Reacta oraz Gatsby'ego. Cay projekt sta si open-source i jest dostpny na GitHubie, a wszystkie artykuy pisane s teraz w MDX - plikach Markdown wzbogaconych o skadni JSX. Przy pomocy tych samych technologii powstaa strona portfolio, kt贸r wanie czytasz."
  },
  "smartHome": {
    "title": "System smart home",
    "description": "Frontend oraz backend do zarzdzania systemem smart home opartym na Home Assistant. Interfejs napisany w Reactcie i przystosowany do obsugi na tablecie w trybie kioskowym. Automatyzacje tworzyem pocztkowo w rodowisku graficznym NodeRed, ale przez ich rosnc zo偶ono i bugi przepisaem je do backendu Node.js. Obsuguje on teraz wszystkie moje automatyzacje, pobiera dane pogodowe oraz steruje systemem powiadomie. Home Assistant su偶y jedynie jako rdze do komunikacji z urzdzeniami. Cao dziaa w kontenerach Dockerowych postawionych na Proxmoxie i opiera si na komunikacji WebSockets, ZigBee oraz MQTT."
  },
  "irlTracker": {
    "title": "IRL Tracker",
    "description": "System do ledzenia lokalizacji stworzony do prowadzenia stream贸w IRL. Aplikacja na telefon odbiera dane GSM/GPS, przesya je na serwer, a nastpnie do widgetu z map widocznego na transmisji internetowej. Aplikacja ponadto obsuguje sensory ttna oraz opaski sportowe Bluetooth do pokazywania szybkoci bicia serca streamera. Opr贸cz tego posiada wbudowan przegldark czatu Twitcha oraz pozwala na obsug kilku u偶ytkownik贸w jednoczenie (podw贸jny widget widoczny na miniaturce u dou)."
  },
  "diyArduinoDashboard": {
    "title": "DIY Arduino Dashboard",
    "description": "Projekt DIY, kt贸ry by zar贸wno moim wstpem do wiata elektroniki, jak i najbardziej skomplikowanym dzieem. W skad projektu wchodziy cztery elementy. Pierwsz rzecz by napisany w C# i WPF interpreter telemetrii gier Euro Truck Simulator 2 oraz American Truck Simulator. Drug by kod C++ dla Arduino, trzeci generator tarcz zegar贸w napisany w C# i WPF. Ostatnim elementem ukadanki byy rcznie wykonane zegary samochodowe. Powstay one na bazie Volkwagena Golfa 4. generacji i posiaday 4 zegary analogowe, 16 kontrolek ostrzegawczych oraz wywietlacz LCD z peni interaktywnym komputerem pokadowym. Tarcze zegar贸w zostay zaprojektowane przeze mnie od podstaw, a nastpnie wykonane z kilku sklejonych ze sob materia贸w. Kod wszystkich program贸w oraz schematy elektryczne s dostpne na GitHubie. Dziaanie oraz proces budowy zegar贸w mo偶na zobaczy na blogu Redark.pl."
  },
  "raspberryBookReader": {
    "title": "Raspberry Book Reader",
    "description": "Czytnik audiobook贸w dostosowany do obsugi przez osoby starsze/niedowidzce. By to m贸j drugi projekt DIY i stworzyem go dla swojej babci. Sercem ukadu jest Raspberry Pi 3 B+ oraz m贸j pierwszy skrypt napisany w Pythonie. Cao pracowaa na Linuxie w interfejsie tekstowym i korzystaa z biblioteki VLC. Za proste oraz bezpieczne wczanie i wyczanie mikrokomputera odpowiada ukad Arduino ATtiny85, kt贸ry komunikowa si z systemem operacyjnym oraz sterowa zasilaniem ukadu. Dziaanie oraz proces budowy czytnika mo偶na zobaczy na blogu Redark.pl."
  }
}
